FreeRTOS/FreeRTOS/FreeRTOS-Plus/Demo/FreeRTOS_Plus_UDP_and_CLI_LPC1830_GCC/ThirdParty/CMSISv2p10_LPC18xx_DriverLib/src/lpc18xx_uart.c
	CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->AutoAddrDetect_State));
	CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->AutoDirCtrl_State));
	CHECK_PARAM(PARAM_UART_RS485_CFG_DELAYVALUE(RS485ConfigStruct->DelayValue));
	CHECK_PARAM(PARAM_SETSTATE(RS485ConfigStruct->DirCtrlPol_Level));
	CHECK_PARAM(PARAM_UART_RS485_DIRCTRL_PIN(RS485ConfigStruct->DirCtrlPin));
	CHECK_PARAM(PARAM_UART_RS485_CFG_MATCHADDRVALUE(RS485ConfigStruct->MatchAddrValue));
	CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->NormalMultiDropMode_State));
	CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->Rx_State));

	tmp = 0;
	// If Auto Direction Control is enabled -  This function is used in Master mode
	if (RS485ConfigStruct->AutoDirCtrl_State == ENABLE)
	{
		tmp |= UART_RS485CTRL_DCTRL_EN;

		// Set polar
		if (RS485ConfigStruct->DirCtrlPol_Level == SET)
		{
			tmp |= UART_RS485CTRL_OINV_1;
		}

		// Set pin according to
		if (RS485ConfigStruct->DirCtrlPin == UART_RS485_DIRCTRL_DTR)
		{
			tmp |= UART_RS485CTRL_SEL_DTR;
		}

		// Fill delay time
		if (((LPC_UART1_Type *)UARTx) == LPC_UART1)
		{
			((LPC_UART1_Type *)UARTx)->RS485DLY = RS485ConfigStruct->DelayValue & UART_RS485DLY_BITMASK;
		}
		else
		{
			UARTx->RS485DLY = RS485ConfigStruct->DelayValue & UART_RS485DLY_BITMASK;
		}
	}

	// MultiDrop mode is enable
	if (RS485ConfigStruct->NormalMultiDropMode_State == ENABLE)
	{
		tmp |= UART_RS485CTRL_NMM_EN;
	}

	// Auto Address Detect function
	if (RS485ConfigStruct->AutoAddrDetect_State == ENABLE)
	{
		tmp |= UART_RS485CTRL_AADEN;
		// Fill Match Address
		if (((LPC_UART1_Type *)UARTx) == LPC_UART1)
		{
			((LPC_UART1_Type *)UARTx)->RS485ADRMATCH = RS485ConfigStruct->MatchAddrValue & UART_RS485ADRMATCH_BITMASK;
		}
		else
		{
			UARTx->RS485ADRMATCH = RS485ConfigStruct->MatchAddrValue & UART_RS485ADRMATCH_BITMASK;
		}
	}


	// Receiver is disable
	if (RS485ConfigStruct->Rx_State == DISABLE)
	{
		tmp |= UART_RS485CTRL_RX_DIS;
	}

	// write back to RS485 control register
	if (((LPC_UART1_Type *)UARTx) == LPC_UART1)
	{
		((LPC_UART1_Type *)UARTx)->RS485CTRL = tmp & UART_RS485CTRL_BITMASK;
	}
	else
	{
		UARTx->RS485CTRL = tmp & UART_RS485CTRL_BITMASK;
	}

	// Enable Parity function and leave parity in stick '0' parity as default
	if (((LPC_UART1_Type *)UARTx) == LPC_UART1)
	{
		((LPC_UART1_Type *)UARTx)->LCR |= (UART_LCR_PARITY_F_0 | UART_LCR_PARITY_EN);
	}
	else
	{
		UARTx->LCR |= (UART_LCR_PARITY_F_0 | UART_LCR_PARITY_EN);
	}
}

/*********************************************************************//**
 * @brief		Enable/Disable receiver in RS485 module in UART
 * @param[in]	UARTx	UART peripheral selected, should be:
 * 					- LPC_UART0	:UART0 peripheral
 * 					- LPC_UART1	:UART1 peripheral
 * 					- LPC_UART2	:UART2 peripheral
 * 					- LPC_UART3	:UART3 peripheral
 * @param[in]	NewState	New State of command, should be:
 * 					- ENABLE	:Enable this function.
 * 					- DISABLE	:Disable this function.
 * @return		None
 **********************************************************************/
void UART_RS485ReceiverCmd(LPC_USARTn_Type *UARTx, FunctionalState NewState)
{
	if (((LPC_UART1_Type *)UARTx) == LPC_UART1)
	{
		if (NewState == ENABLE){
			((LPC_UART1_Type *)UARTx)->RS485CTRL &= ~UART_RS485CTRL_RX_DIS;
		} else {
			((LPC_UART1_Type *)UARTx)->RS485CTRL |= UART_RS485CTRL_RX_DIS;
		}
	}
	else
	{
		if (NewState == ENABLE){
			UARTx->RS485CTRL &= ~UART_RS485CTRL_RX_DIS;
		} else {
			UARTx->RS485CTRL |= UART_RS485CTRL_RX_DIS;
		}
	}
}

/*********************************************************************//**
 * @brief		Send data on RS485 bus with specified parity stick value (9-bit mode).
 * @param[in]	UARTx	UART peripheral selected, should be:
 * 					- LPC_UART0	:UART0 peripheral
 * 					- LPC_UART1	:UART1 peripheral
 * 					- LPC_UART2	:UART2 peripheral
 * 					- LPC_UART3	:UART3 peripheral
 * @param[in]	pDatFrm 	Pointer to data frame.
 * @param[in]	size		Size of data.
 * @param[in]	ParityStick	Parity Stick value, should be 0 or 1.
 * @return		None
 **********************************************************************/
uint32_t UART_RS485Send(LPC_USARTn_Type *UARTx, uint8_t *pDatFrm, \
					uint32_t size, uint8_t ParityStick)
{
	uint8_t tmp, save;
	uint32_t cnt;
	if (((LPC_UART1_Type *)UARTx) == LPC_UART1)
	{
		if (ParityStick){
			save = tmp = ((LPC_UART1_Type *)UARTx)->LCR & UART_LCR_BITMASK;
			tmp &= ~(UART_LCR_PARITY_EVEN);
			((LPC_UART1_Type *)UARTx)->LCR = tmp;
			cnt = UART_Send((LPC_USARTn_Type *)UARTx, pDatFrm, size, BLOCKING);
			while (!(((LPC_UART1_Type *)UARTx)->LSR & UART_LSR_TEMT));
			((LPC_UART1_Type *)UARTx)->LCR = save;
		} else {
			cnt = UART_Send((LPC_USARTn_Type *)UARTx, pDatFrm, size, BLOCKING);
			while (!(((LPC_UART1_Type *)UARTx)->LSR & UART_LSR_TEMT));
		}
	}
	else
	{
		if (ParityStick){
			save = tmp = UARTx->LCR & UART_LCR_BITMASK;
			tmp &= ~(UART_LCR_PARITY_EVEN);
			UARTx->LCR = tmp;
			cnt = UART_Send((LPC_USARTn_Type *)UARTx, pDatFrm, size, BLOCKING);
			while (!(UARTx->LSR & UART_LSR_TEMT));
			UARTx->LCR = save;
		} else {
			cnt = UART_Send((LPC_USARTn_Type *)UARTx, pDatFrm, size, BLOCKING);
			while (!(UARTx->LSR & UART_LSR_TEMT));
		}
	}
	return cnt;
}

/*********************************************************************//**
 * @brief		Send Slave address frames on RS485 bus.
 * @param[in]	UARTx	UART peripheral selected, should be:
 * 					- LPC_UART0	:UART0 peripheral
 * 					- LPC_UART1	:UART1 peripheral
 * 					- LPC_UART2	:UART2 peripheral
 * 					- LPC_UART3	:UART3 peripheral
 * @param[in]	SlvAddr Slave Address.
 * @return		None
 **********************************************************************/
void UART_RS485SendSlvAddr(LPC_USARTn_Type *UARTx, uint8_t SlvAddr)
{
	UART_RS485Send(UARTx, &SlvAddr, 1, 1);
}

/*********************************************************************//**
 * @brief		Send Data frames on RS485 bus.
 * @param[in]	UARTx	UART peripheral selected, should be:
 * 					- LPC_UART0	:UART0 peripheral
 * 					- LPC_UART1	:UART1 peripheral
 * 					- LPC_UART2	:UART2 peripheral
 * 					- LPC_UART3	:UART3 peripheral
 * @param[in]	pData Pointer to data to be sent.
 * @param[in]	size Size of data frame to be sent.
 * @return		None
 **********************************************************************/
uint32_t UART_RS485SendData(LPC_USARTn_Type *UARTx, uint8_t *pData, uint32_t size)
{
	return (UART_RS485Send(UARTx, pData, size, 0));
}


#endif /* _UART */

/**
 * @}
 */

/**
 * @}
 */
/* --------------------------------- End Of File ------------------------------ */

